# **End of Phase 1 Project.**

### This Project is designed to test my understanding in Phase 0 and Phase 1 content.

### Specifically, this will cover:
     1. Business Understanding.
     2. Data Understanding.
     3. Data Exploration.
     4. Data Cleaning.
     5. Data Analysis.
     6. Data Visualization.

## **1. Business Understanding.**

Microsoft want to create a new movie studio. They are unsure on where to start. I will be exploring on what type of films are currently doing the best at the Box office. This will enable me to make recommendations about attributes that Microsoft's movies should have in order to attain the highest revenue.

**I will base my analysis on the following factors;**
1. Movie type: What type of movie content are currently most successful?
2. Production budget: What budget amount tends to achieve the highest box office gross?
3. Released date: When is the best time of the year to release a movie?

## **2. Data Understanding.**

### I utilized three different data sources for my analysis in order to have the most comprehensive view of the industry as it currently is.
These data sets include;
1. The Numbers
2. The MovieDB
3. Box Office Mojo

### **Importing relevant python libraries.**

In [1]:
import pandas as pd
import numpy as np
import seaborn as sn
import matplotlib.pyplot as plt
import sqlite3

%matplotlib inline

### Reading the Data

**The Numbers Dataset.**

In [19]:
#reading the csv file.
df_TheNumbers = pd.read_csv('datasets/tn.movie_budgets.csv')
#displaying the first five rows of the dataframe.
df_TheNumbers.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [18]:
#checking the shape of the dataframe.
df_TheNumbers.shape

(5782, 6)

In [7]:
#getting info for dataframe.
df_TheNumbers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [26]:
# getting counts for each value in production_budget column
df_TheNumbers['production_budget'].value_counts()

$20,000,000    231
$10,000,000    212
$30,000,000    177
$15,000,000    173
$25,000,000    171
              ...
$114,000         1
$4,638,783       1
$7,303,082       1
$30,250,000      1
$2,686,000       1
Name: production_budget, Length: 509, dtype: int64

In [31]:
# getting counts for each value in release_date column
df_TheNumbers['release_date'].value_counts()

Dec 31, 2014    24
Dec 31, 2015    23
Dec 31, 2010    15
Dec 31, 2008    14
Dec 31, 2012    13
                ..
Jun 26, 1936     1
Feb 19, 2002     1
Jun 27, 1997     1
Mar 11, 2008     1
Feb 7, 1997      1
Name: release_date, Length: 2418, dtype: int64

In [32]:
# getting counts for each value in movie column
df_TheNumbers['movie'].value_counts()

King Kong                      3
Halloween                      3
Home                           3
RoboCop                        2
The Calling                    2
                              ..
Adrift                         1
Frailty                        1
Scott Pilgrim vs. The World    1
Mission: Impossible 2          1
Becoming Jane                  1
Name: movie, Length: 5698, dtype: int64

**The MovieDB Dataset.**

In [20]:
#reading the csv file.
df_TheMovieDB=pd.read_csv('datasets/tmdb.movies.csv')
#displaying the first five rows of the dataframe.
df_TheMovieDB.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [21]:
#checking the shape of the dataframe.
df_TheMovieDB.shape

(26517, 10)

In [22]:
#getting info for dataframe.
df_TheMovieDB.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         26517 non-null  int64
 1   genre_ids          26517 non-null  object
 2   id                 26517 non-null  int64
 3   original_language  26517 non-null  object
 4   original_title     26517 non-null  object
 5   popularity         26517 non-null  float64
 6   release_date       26517 non-null  object
 7   title              26517 non-null  object
 8   vote_average       26517 non-null  float64
 9   vote_count         26517 non-null  int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

In [27]:
# getting counts for each value in title column
df_TheMovieDB['title'].value_counts()

Eden                                     7
Home                                     7
Alone                                    5
The Gift                                 5
The Box                                  5
                                        ..
One Direction: Reaching For The Stars    1
Toeing the Line                          1
Flatliners                               1
The One-Eyed King                        1
The Gatekeepers                          1
Name: title, Length: 24688, dtype: int64

In [30]:
# getting counts for each value in release_date column
df_TheMovieDB['release_date'].value_counts()

2010-01-01    269
2011-01-01    200
2014-01-01    155
2012-01-01    155
2013-01-01    145
             ...
2018-05-08      1
2017-11-06      1
2010-05-26      1
2010-03-04      1
2016-12-27      1
Name: release_date, Length: 3433, dtype: int64

**Box Office Mojo Dataset.**

In [23]:
#reading the csv file.
df_BoxOfficeMojo = pd.read_csv('datasets/bom.movie_gross.csv')
#displaying the first five rows of the dataset.
df_BoxOfficeMojo.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [24]:
#checking the shape of the dataframe.
df_BoxOfficeMojo.shape

(3387, 5)

In [25]:
#getting info for dataframe.
df_BoxOfficeMojo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [28]:
# getting counts for each value in year column
df_BoxOfficeMojo['year'].value_counts()

2015    450
2016    436
2012    400
2011    399
2014    395
2013    350
2010    328
2017    321
2018    308
Name: year, dtype: int64

In [29]:
# getting counts for each value in title column
df_BoxOfficeMojo['title'].value_counts()

Bluebeard            2
Mother (2010)        1
Fill the Void        1
Bright Days Ahead    1
Phillauri            1
                    ..
22 Bullets           1
Tracks (2014)        1
Creed                1
The Help             1
Pain and Gain        1
Name: title, Length: 3386, dtype: int64

## **3. Data Preparation.**

## **3.1 Data Cleaning.**

**Checking for duplicates.**

In [37]:
df_TheNumbers.duplicated().value_counts()
df_TheNumbers.shape

(5782, 6)

In [34]:
df_TheMovieDB.duplicated().value_counts()

False    26517
dtype: int64

In [35]:
df_BoxOfficeMojo.duplicated().value_counts()

False    3387
dtype: int64

In [36]:
df_TheNumbers = df_TheNumbers.drop_duplicates()
df_TheNumbers.shape

(5782, 6)

In [39]:

new_df_TheNumbers = df_TheNumbers.dropna()
new_df_TheNumbers

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"